## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/10848188684)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * google_service_account.sa-gke-kyma-integration
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner
* Replace
  * google_artifact_registry_repository_iam_member.dockerhub_mirror_access



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository_iam_member.dockerhub_mirror_access must be replaced
-/+ resource "google_artifact_registry_repository_iam_member" "dockerhub_mirror_access" {
      ~ etag       = "BwYh/T5WIaE=" -> (known after apply)
      ~ id         = "projects/sap-kyma-prow/locations/europe-west4/repositories/dockerhub-mirror/roles/artifactregistry.reader/serviceAccount:kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ location   = "europe-west4" -> (known after apply)
      ~ member     = "serviceAccount:kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com" -> "serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com" # forces replacement
      ~ project    = "sap-kyma-prow" -> (known after apply)
      ~ repository = "projects/sap-kyma-prow/locations/europe-west4/repositories/dockerhub-mirror" -> "dockerhub-mirror"
        # (1 unchanged attribute hidden)
    }

  # google_service_account.sa-gke-kyma-integration will be updated in-place
  ~ resource "google_service_account" "sa-gke-kyma-integration" {
      ~ description  = "Service account is used by Prow to integrate with GKE." -> "Service account is used by Prow to integrate with GKE. Will be removed with Prow"
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11904,"Program":"tfcmt","SHA1":"0f8d13987d7e600e912c233686362003d5cfc8de","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->